[
  {
    "Type": "CreditScore",
    "RangeFrom": 0,
    "RangeTo": 0,
    "ColorCode": "#C0C0C0",
    "ScoreType": "YouDon'tHaveACreditScore",
    "Description": "<p class=\"sal-text-p\">You don't appear to be credit active at the moment. This means that it is not possible to generate a credit score for you. If you want to start building up your credit score, it's a good idea to open a store account, a cellphone contract or an insurance policy. Always ensure you pay these on time or even before the due date. Contact our coach to discuss your options.</p>"
  },
  {
    "Type": "CreditScore",
    "RangeFrom": 1,
    "RangeTo": 20,
    "ColorCode": "#F63434",
    "ScoreType": "VeryHighRisk",
    "Description": "<p class=\"sal-text-p\">Your credit score is low and it's unlikely you will qualify for further credit. It is important to always pay your instalments on time. You must pay the full amount due by the due date so that your score will improve over time. If you are new to credit and want to start building up your credit score it's a good idea to open a store account, a cellphone contract or an insurance policy.  Contact our coach to discuss your options.</p>"
  },
  {
    "Type": "CreditScore",
    "RangeFrom": 21,
    "RangeTo": 40,
    "ColorCode": "#F19044",
    "ScoreType": "HighRisk",
    "Description": "<p class=\"sal-text-p\">You are considered high risk to lenders and are unlikely to qualify for further credit at this stage. If you are offered credit, it is likely to be expensive (high interest rates). You can improve your credit score by making full payments on time and resolving any negative factors that may appear on your report. Contact our coach to discuss your options.</p>"
  },
  {
    "Type": "CreditScore",
    "RangeFrom": 41,
    "RangeTo": 60,
    "ColorCode": "#F8D926",
    "ScoreType": "MediumRisk",
    "Description": "<p class=\"sal-text-p\">You are considered a medium risk to lenders and may qualify for further credit. However, if you are offered credit it is likely to be expensive (high interest rates). You can improve your credit score by making full payments on time and resolving any negative factors that may appear on your report. Contact our coach to discuss your options.</p>"
  },
  {
    "Type": "CreditScore",
    "RangeFrom": 61,
    "RangeTo": 80,
    "ColorCode": "#A5C15E",
    "ScoreType": "LowRisk",
    "Description": "<p class=\"sal-text-p\">You are considered low risk. Well done! If you need credit you will likely qualify for it and you should get a good interest rate. Keep up the good work and always pay your instalments on time. Contact our coach to discuss your options.</p>"
  },
  {
    "Type": "CreditScore",
    "RangeFrom": 81,
    "RangeTo": 100,
    "ColorCode": "#30955F",
    "ScoreType": "VeryLowRisk",
    "Description": "<p class=\"sal-text-p\">You are considered very low risk. Well done! If you need credit you will likely qualify for it and you should get a good interest rate.  Keep up the good work.</p>"
  },
  {
    "Type": "MoneyLeftForExpenses",
    "RangeFrom": -999999,
    "RangeTo": 25,
    "ColorCode": "#F63434",
    "ScoreType": "VeryHighRisk",
    "Description": "<h4 class=\"sal-text-caption d-sm-none d-md-block\">You are Very High Risk</h4><p class=\"sal-text-p\">Our calculations show you do not have much disposable income left to pay for your credit expenses.  If the income information we have is incorrect please enter the correct details in the customer maintenance section.  If they are correct you must try to settle some credit accounts to give you additional disposable income.  Start with the smallest ones first. Importantly, contact our coach to discuss your options.</p>"
  },
  {
    "Type": "MoneyLeftForExpenses",
    "RangeFrom": 26,
    "RangeTo": 50,
    "ColorCode": "#F19044",
    "ScoreType": "HighRisk",
    "Description": "<h4 class=\"sal-text-caption d-sm-none d-md-block\">You are High Risk</h4><p class=\"sal-text-p\">Our calculations show you do not have much disposable income left to pay for your credit expenses.  If the income information we have is incorrect please enter the correct details in the customer maintenance section.  If they are correct, you must try to settle some credit accounts to give you additional disposable income.  Start with the smallest ones first.  Importantly, contact our coach to discuss your options.</p>"
  },
  {
    "Type": "MoneyLeftForExpenses",
    "RangeFrom": 51,
    "RangeTo": 75,
    "ColorCode": "#A5C15E",
    "ScoreType": "LowRisk",
    "Description": "<h4 class=\"sal-text-caption d-sm-none d-md-block\">You are Low Risk</h4><p class=\"sal-text-p\">You should aim to have more than 60% of your income left after paying your credit accounts and our calculations show you have slightly less than this. If the income information we have is incorrect please enter the correct details in the customer maintenance section.  If they are correct, you must try to settle some credit accounts to give you additional disposable income.  Start with the smallest ones first.  Importantly, contact our coach to discuss your options.</p>"
  },
  {
    "Type": "MoneyLeftForExpenses",
    "RangeFrom": 76,
    "RangeTo": 100,
    "ColorCode": "#30955F",
    "ScoreType": "VeryLowRisk",
    "Description": "<h4 class=\"sal-text-caption d-sm-none d-md-block\">You are Very Low Risk</h4><p class=\"sal-text-p\">Well done! It looks like you have some disposable income available. Are you putting enough of this towards savings and investments? Speak to a coach if you'd like to discuss your options.</p>"
  },
  {
    "Type": "SalaryTowardDebt",
    "RangeFrom": 81,
    "RangeTo": 999999,
    "ColorCode": "#F63434",
    "ScoreType": "VeryHighRisk",
    "Description": "<h4 class=\"sal-text-caption d-sm-none d-md-block\">You are Very High Risk</h4><p class=\"sal-text-p\">The information we have indicates that your monthly credit repayments as a percentage of your monthly income is very high and you are likely to be regarded as high risk by many credit providers.  You should aim to spend less than 40% of your monthly income on credit repayments.  Please call our coach who can help you with a free assessment.</p>"
  },
  {
    "Type": "SalaryTowardDebt",
    "RangeFrom": 61,
    "RangeTo": 80,
    "ColorCode": "#F19044",
    "ScoreType": "HighRisk",
    "Description": "<h4 class=\"sal-text-caption d-sm-none d-md-block\">You are High Risk</h4><p class=\"sal-text-p\">Your credit position is not optimal. Ideally, you should aim to spend less than 40% of your income on credit repayments. Our coach can help you with a free assessment.</p>"
  },
  {
    "Type": "SalaryTowardDebt",
    "RangeFrom": 41,
    "RangeTo": 60,
    "ColorCode": "#F8D926",
    "ScoreType": "MediumRisk",
    "Description": "<h4 class=\"sal-text-caption d-sm-none d-md-block\">You are Medium Risk</h4><p class=\"sal-text-p\">You should aim to spend less than 40% of your monthly income on credit repayment.  The information we have shows that you are slightly over this, but the good news is that you are almost there.  Our coach can help you with a free assessment over the phone. </p>"
  },
  {
    "Type": "SalaryTowardDebt",
    "RangeFrom": 21,
    "RangeTo": 40,
    "ColorCode": "#A5C15E",
    "ScoreType": "LowRisk",
    "Description": "<h4 class=\"sal-text-caption d-sm-none d-md-block\">You are Low Risk</h4><p class=\"sal-text-p\">The information we have on you indicates that your monthly credit repayments as a percentage of your monthly income is reasonable and you should be able to afford the existing credit you have.  You should also consider additional investments, such as retirement annuities, to ensure you have sufficient savings when you retire. Please speak to our coach to discuss your options.</p>"
  },
  {
    "Type": "SalaryTowardDebt",
    "RangeFrom": 0,
    "RangeTo": 20,
    "ColorCode": "#30955F",
    "ScoreType": "VeryLowRisk",
    "Description": "<h4 class=\"sal-text-caption d-sm-none d-md-block\">You are Very Low Risk</h4><p class=\"sal-text-p\">Our information indicates that your income as a percentage of your total credit repayments is good.  You should be in a healthy position and could possibly even afford more credit if the need arises.  Alternatively, consider investing in savings and/or retirement plans.  Speak to our coach to discuss your options.  It's a free service.</p>"
  },
  {
    "Type": "MonthlyInterestPayments",
    "RangeFrom": 16,
    "RangeTo": 100,
    "ColorCode": "#F19044",
    "ScoreType": "HighRisk",
    "Description": "<h4 class=\"sal-text-caption d-sm-none d-md-block\">You are High Risk</h4><p class=\"sal-text-p\">Your credit is costing you a lot.  We suggest you try to settle your accounts with the highest interest rates first.  If have get extra cash you should put it towards paying off these accounts.  Speak to our coach to discuss your options - it’s a free service.</p>"
  },
  {
    "Type": "MonthlyInterestPayments",
    "RangeFrom": 11,
    "RangeTo": 15,
    "ColorCode": "#F8D926",
    "ScoreType": "MediumRisk",
    "Description": "<h4 class=\"sal-text-caption d-sm-none d-md-block\">You are Medium Risk</h4><p class=\"sal-text-p\">It looks like you are paying a reasonable amount on interest, when compared with your peers. It is, however, important to try and settle the accounts with the highest interest rates first, so if you have disposable income at the end of the month try to put it towards paying off your accounts.  Also speak to our coach to discuss your options.</p>"
  },
  {
    "Type": "MonthlyInterestPayments",
    "RangeFrom": 0,
    "RangeTo": 10,
    "ColorCode": "#30955F",
    "ScoreType": "LowRisk",
    "Description": "<h4 class=\"sal-text-caption d-sm-none d-md-block\">You are Low Risk</h4><p class=\"sal-text-p\">The interest you are paying relative to your peers looks reasonable.  If you want to consult a coach on how to reduce this further, or how to invest wisely, please call them.  It's a free service.</p>"
  },
  {
    "Type": "TotalOverdueAmount",
    "RangeFrom": 502,
    "RangeTo": 99999999,
    "ColorCode": "#F63434",
    "ScoreType": "VeryHighRisk",
    "Description": "<h4 class=\"sal-text-caption d-sm-none d-md-block\">You are Very High Risk</h4><p class=\"sal-text-p\">Your overdue amount on credit accounts is high and this has started to affect your credit score negatively. Credit providers are likely to see you as high risk and therefore access to future credit may either be denied or it may be very expensive.  Your priority is to make sure that you pay any overdue amounts as soon as possible.  This will positively affect your score over time. Chat to our coach to discuss your options. It's a free service we offer.</p>"
  },
  {
    "Type": "TotalOverdueAmount",
    "RangeFrom": 1,
    "RangeTo": 501,
    "ColorCode": "#F19044",
    "ScoreType": "HighRisk",
    "Description": "<h4 class=\"sal-text-caption d-sm-none d-md-block\">You are High Risk</h4><p class=\"sal-text-p\">You have some overdue accounts. Having overdue accounts affects your credit score negatively and you may be seen as high risk by credit providers, which could prevent you from obtaining additional credit. The good news is that if you catch up on all overdue amounts and keep these up to date, your credit score can improve. Chat to our coach if you'd like to discuss your options.</p>"
  },
  {
    "Type": "TotalOverdueAmount",
    "RangeFrom": 0,
    "RangeTo": 0,
    "ColorCode": "#A5C15E",
    "ScoreType": "LowRisk",
    "Description": "<h4 class=\"sal-text-caption d-sm-none d-md-block\">You are Low Risk</h4><p class=\"sal-text-p\">Well done! You are up to date on all your credit accounts.  Feel free to chat to a coach for further information on your credit profile.</p>"
  }]